// 증감 연산자 : 전위(pre-fix) 증감 연산자 응용 II

package com.eomcs.basic.ex05;

public class Exam0682 {
  public static void main(String[] args) {
    // 주의!
    //  1) pre-fix 연산자나 post-fix 연산자를 리터럴에 적용할 수 없다.
    //int x = ++100; // 컴파일 오류!
    //x = 100++; // 컴파일 오류!

    //  2) 변수에 동시에 적용할 수 없다.
    //     후위 연산자와 전위 연산자는 '변수'를 증감하는 것이다.
    
    int y = 100;
    //++y++; // 컴파일 오류!
    //(++y)++; // 컴파일 오류!
    //          => (++y)를 하고나면 그 자리에 값이 놓임! 
    //             값에는 후위 연산자를 적용할 수 없다.
    //++(y++); // 컴파일 오류!
    //          => (y++)를 하고나면 그 자리에 값이 놓임! 
    //             값에는 전위 연산자를 적용할 수 없다.
  }
}
