// 비트 이동 연산자 : >>, >>>, <<

package com.eomcs.basic.ex05;

public class Exam0411 {
  public static void main(String[] args) {

    // 0111 1111 1111 1111 1111 1111 1111 1010 =  21_4748_3642
    // 1000 0000 0000 0000 0000 0000 0000 0110 = -21_4748_3642

    // 음수에서 <<로 비트를 이동할 때, 부호비트에 상관없이 이동
    int a = -0x7f_ff_ff_fa; // -21_4748_3642
    System.out.println(a);      //      1000 0000 0000 0000 0000 0000 0000 0110
    System.out.println(a << 1); //    1|0000 0000 0000 0000 0000 0000 0000 1100 = 12
    System.out.println(a << 2); //   10|0000 0000 0000 0000 0000 0000 0001 1000 = 24
    System.out.println(a << 3); //  100|0000 0000 0000 0000 0000 0000 0011 0000 = 48
    System.out.println(a << 4); // 1000|0000 0000 0000 0000 0000 0000 0110 0000 = 96

    // 결론!
    //  왼쪽으로 x 만큼 비트를 이동시키는 것은 주어진 양수 대해 2**x 로 곱한 것과 같다.
    // 주의!
    //  음수의 경우는 양수로 바뀔 수 있다.
  }
}