// 주제 : 부동소수점의 정규화 = 2진수로 바꾸기

package com.eomcs.basic.ex03;


class Exam0350 {
  public static void main(String[] args) {
    System.out.println(12.375f);
    System.out.println(12.375);
    System.out.println(-12.375f);
        
    // 12.375(부동소수점)
    // ==> IEEE 754 규정에 따라 부동소수점을 2진수로 변환한다.
    // ==> 01000001 01000110 00000000 00000000 (2진수)
    // ==> 41460000 (16진수)
  }
}

// 방법
// 1) 소수점 이상 부분을 2진수로 변환
// - 12 (10진수)
// - 1100 (2진수)

// 2) 소수점 이하 부분을 2진수로 변환
// - .375
// - 소수점을 2로 곱하여 나온 결과에서 정수 부분만을 차례대로 표기한다.
// - 소수 부분이 0이거나 반복되면 계산을 멈춘다.
// - 예: 0.375(10진수)
//  0.375 * 2 = 0.75  --> 0
//  0.75 * 2  = 1.5   --> 1
//  0.5 * 2   = 1.0   --> 1
//  => 0.011(2진수)

// 3) 소수점 이상 2진수와 소수점 이하 2진수를 합친다.
// => 12(1100) + .375(0.011) = 1100.011

// 4) 정규화
// => 소수점 위치를 조정하여 가수부와 지수부를 분리한다.

// => 4.1: 소수점 왼쪽에 1만 남도록 소수점을 이동한다.
//      - 1100.011 -> 1.100011
//      - 1.100011 * 2**3 = 1100.011
// => 4.2: 소수점의 앞의 1은 무조건 1이기 때문에 버린다.
//      - 100011 * 2**3

// => 4.3: 가수부와 지수부로 분리한다.
//      가수부
//       - Sign-Magnitude로 표현한다.
//       - 따라서 음수나 양수나 같은 2진수 값을 갖는다. 
//      지수부(8비트)
//      - 2의 제곱승 값이다.
//      - Excess-k로 표현한다.
//      - k값은 127이다.
//      - 예) 3(2의 제곱승) + 127(k값: bias) = 130
//          130 = 10000010(2진수)

// => 4.4: 32비트 메모리에 담기 (32비트 = 4바이트)
//      - [1: 부호비트][8: 지수부][23: 가수부] = 32비트
//      - 예)[0][10000010][10001100000000000000000] 
//          -> 01000001_01000110_00000000_00000000
//          -> 41_46_00_00 (16진수)
//      - -12.375를 정규화한다면?
//          -> 11000001_01000110_00000000_00000000
//          -> c1_46_00_00 (16진수)

//=> 4.5: 64비트 메모리에 담기 (64비트 = 8바이트)
//      - [1:부호비트][11:지수부][52:가수부] = 64비트
//      - 부호비트(1) = 0
//      - 지수부(11) = 3 + (2**(11-1) - 1) = 3 + (1024 - 1) = 3 + 1023 = 1026
//                  = 100_0000_0010
//      - 가수부(52) = 100011
//      - 예) 0_10000000010_1000110000000000000000000000000000000000000000000000
//           = 01000000_00101000_11000000_00000000_00000000_00000000_00000000_00000000
//           = 40_28_c0_00_00_00_00_00(16진수)


//주의!
//- 유효 자릿수의 부동소수점이라도 정규화할 때 2진수로 딱 떨어지지 않은 경우가 있다.
//- 예) 2.127
//2 => 0010
//0.127 => 
//0.127 * 2 = 0.254 --> 0
//0.254 * 2 = 0.508 --> 0
//0.508 * 2 = 1.016 --> 1
//0.016 * 2 = 0.032 --> 0
//0.032 * 2 = 0.064 --> 0
//0.064 * 2 = 0.128 --> 0
//0.128 * 2 = 0.256 --> 0
//0.256 * 2 = 0.512 --> 0
//0.512 * 2 = 1.024 --> 1
//0.024 * 2 = 0.048 --> 0
//....
//이처럼 2진수로 완벽히 표현할 수 없는 수가 있다.
//0.00000....1 의 오차가 있다.
//그래서 부동소수점은 정수와 다르게 정확하게 메모리에 저장되지 않는다.


